# from playwright.sync_api import sync_playwright

# with sync_playwright() as p:
#     browser = p.chromium.launch(executable_path="/Applications/Google Chrome.app/Contents/MacOS/Google Chrome")
#     page = browser.new_page()
#     page.goto("https://github.com/zanetworker/mcp-playground")
#     print(page.title())
#     browser.close()


if __name__ == "__main__":
    t = """
    Title: 猫眼专业版-实时票房\nContent:  01 南京照相馆 上映22天24.13亿 . \uf615万33.3%109771 02 浪浪山小妖怪 上映14天7.78亿 \uec68\uf66d. 万32.3%106610 03 东极岛 上映8天2.84亿 \uef74\ueab3 . 万9.7%57702 04 捕风追影 点映7404.2万 \uf615\ueab3\uf66d. 万6.0%21368 05 奇遇 上映8天1.01亿 \uf615 .\uef74 万5.6%33860 06 罗小黑战记2 上映29天4.30亿 \uec68 . \ueab3万5.2%18689 07 戏台 上映22天3.90亿 \uf66d.\uec68 万1.6%9621 08 F1:狂飙飞车 上映50天4.14亿 \uef74.\uf615\uec68万1.1%1818 09 长安的荔枝 上映29天6.69亿 \uef74 . 万1.0%6890 10 喜羊羊与灰太狼之异国破晓 上映21天5912.4万 \uec68 . 万0.4%4565 11 山河为证 上映首日27.9万 \uec68 . \uf66d万0.4%6522 12 疯狂动物城 15.37亿 \uec68\uf66d.\uf615 万0.3%2155\nURL: https://piaofang.maoyan.com/dashboard\n\nTitle: 票房排片上映日历影库影院\nContent:  南京照相馆 上映22天24.07亿 1238.87 33.3% 27.6% 32.0% 浪浪山小妖怪 上映14天7.72亿 1166.52 31.4% 26.8% 29.7% 东极岛 上映8天2.82亿 343.05 9.2% 14.5% 13.3% 捕风追影 点映7318.2万 252.07 6.7% 5.3% 4.8% 罗小黑战记2 上映29天4.29亿 206.08 5.5% 4.7% 3.6% 奇遇 上映8天1.00亿 180.46 4.8% 8.5% 6.6% 戏台 上映22天3.90亿 69.97 1.8% 2.4% 1.8% F1:狂飙飞车 上映50天4.13亿 50.04 1.3% 0.4% 0.6% 长安的荔枝 上映29天6.69亿 40.40 1.0% 1.7% 1.2% 山河为证 上映首日21.6万 21.65 0.5% 1.6% 1.3%\nURL: https://piaofang.maoyan.com/?ver=normal\n\nTitle: 每日热映票房榜\nContent:  1 浪浪山小妖怪 陈子平,路扬,董汶亮 2025-08-02 总票房: 76069万 昨日票房 4453万 2 南京照相馆 刘昊然,王传君,高叶 2025-07-25 总票房: 239490万 昨日票房 4092万 3 东极岛 朱一龙,吴磊,倪妮 2025-08-08 总票房: 27870万 昨日票房 1570万 4 奇遇 贾冰,王皓,李梦 2025-08-08 总票房: 9833万 昨日票房 995万 5 罗小黑战记2 山新,刘明月,朱婧 2025-07-18 总票房: 42726万 昨日票房 487万 6 戏台 陈佩斯,黄渤,姜武 2025-07-25 总票房: 38980万 昨日票房 183万 7 长安的荔枝 大鹏,白客,庄达菲 2025-07-18 总票房: 66900万 昨日票房 133万 8 F1:狂飙飞车 布拉德·皮特,戴姆森·伊德瑞斯,凯瑞·康顿 2025-06-27 总票房: 41341万 昨日票房 127万 9 喜羊羊与灰太狼之异国破晓 喜羊羊,灰太狼,祖晴 2025-07-26\nURL: http://maoyan.dianping.com/asgard/board/1?_v_=yes\n\nTitle: 猫眼周票房榜\nContent:  1 浪浪山小妖怪 2.25亿票房 动画/ 喜剧 / 剧情 陈子平 / 路扬 / 董汶亮 2025-08-02 09:00中国大陆上映 预告片3个 上美影回归,口碑王炸全家爱看 购票 2 南京照相馆 2.15亿票房 历史/ 剧情 / 战争 刘昊然 / 王传君 / 高叶 2025-07-25 13:00中国大陆上映 预告片5个 取材南京大屠杀日军真实罪证影像 购票 3 东极岛 8759.1万票房 剧情/ 历史 / 战争 朱一龙 / 吴磊 / 倪妮 2025-08-08 09:00中国大陆上映 预告片4个 揭罪行 见血性 让全世界知道 购票 4 捕风追影 5307.6万票房 动作/ 犯罪 / 剧情 成龙/ 张子枫 / 梁家辉 2025-08-16 09:00中国大陆上映 预告片4个 华语动作片 “打”出超高分 购票 5 奇遇 4802.3万票房 喜剧/ 剧情 贾冰/ 王皓 / 李梦 2025-08-08 13:00中国大陆上映 预告片4个 人人都笑我,偏偏我最好笑 购票 6 罗小黑战记2 2533.4万票房 奇幻/ 冒险 / 家庭 / 动画 山新/ 刘明月 / 朱婧 2025-07-18 09:00中国大陆上映 预告片3个 超高分经典国漫 暑期必看合家欢 购票 7 戏台 960.3万票房 剧情/ 喜剧 陈佩斯 / 黄渤 / 姜武 2025-07-25 09:00中国大陆上映 预告片5个 陈佩斯黄渤首合作!笑闹暑期! 购票 8\nURL: https://i.maoyan.com/asgard/board?id=56&term=0&year=0
    """
    import re
    # t = re.sub(r'\n+', '\n', t)
    # t = re.sub(r'\s+', '', t)
    # for i, x in enumerate(t.split("\n")):
    #     print(f"i: {i} content: {x}")

    blocks = re.split(r'\n\s*\n', t.strip())
    for block in blocks:
        title = re.search(r'Title: (.*)', block).group(1)
        content = re.search(r'Content: (.*)', block).group(1)   
        url = re.search(r'URL: (.*)', block).group(1)
        print(f"title: {title}")
        print(f"content: {content}")
        print(f"url: {url}")
        print("-"*100)
